// Напишите программу, которая принимает на вход
//трёхзначное целое число и на выходе показывает сумму
//первой и последней цифры этого числа.
//456 => 10
//782 => 9
//918 => 17
/*
int number = 789;
int FirstDigit = number /100;
int LastDigit = number % 10;

System.Console.WriteLine(FirstDigit + LastDigit);
*/
